
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Определить, нужно ли обновлять дату в движениях.
	ОбновитьДатуДвижений = ЭтоНовый() Или Движения.ОстаткиТоваров.Модифицированность();	
	Если Не ОбновитьДатуДвижений Тогда
		
		// Проверить, что дата изменилась.
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		| Дата
		|ИЗ
		| Документ.ВводНачальныхОстатковТоваров
		|ГДЕ
		| Ссылка = &ТекущийДокумент"; 	 
		
		Выборка = Запрос.Выполнить().Выбрать();		
		Выборка.Следующий(); 	
		ОбновитьДатуДвижений = Выборка.Дата <> Дата;  	
		
	КонецЕсли;   	
	
	// Установить всем новую дату, если нужно.
	Если ОбновитьДатуДвижений Тогда  	                              	
		
		Если Не Движения.ОстаткиТоваров.Выбран() И Не Движения.ОстаткиТоваров.Модифицированность() Тогда			
			Движения.ОстаткиТоваров.Прочитать(); 		
			
		КонецЕсли;
		
		Для Каждого ЗаписьРегистра Из Движения.ОстаткиТоваров Цикл
			ЗаписьРегистра.Период = Дата; 	
			
		КонецЦикла;	
		
			
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	Префикс = Обмен.ПолучитьПрефиксНомера();
	
КонецПроцедуры
