  
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
    СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
    РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти); 
	
КонецПроцедуры

//Вопрос задается перед подбором номенклатуры в табличную часть
//Множественный подбор с использованием множественного выбора
&НаКлиенте
Асинх Процедура ПодборВопрос(Команда)
	
  Результат = Ждать ВопросАсинх("Подобрать номенклатуру в документ?", РежимДиалогаВопрос.ДаНет);
     
  Если Результат = КодВозвратаДиалога.Да Тогда
	   ПараметрыФормы = Новый Структура("ЗакрыватьПриВыборе, МножественныйВыбор", Ложь, Истина);
       ОткрытьФорму("Справочник.Товары.ФормаВыбора", ПараметрыФормы, Элементы.Товары);
  КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
		
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ВыбранныйЭлемент;
		
	КонецЦикла;	
	
	
КонецПроцедуры


////Вопрос задается перед добавлением номенклатуры в табличную часть
////Одиночный подбор с использованием множественного выбора 

//&НаКлиенте
//Процедура Подбор(Команда)
//	
//	ПараметрыФормы = Новый Структура("МножественныйВыбор", Истина);
//	ОткрытьФорму("Справочник.Товары.ФормаВыбора", ПараметрыФормы, Элементы.Товары);
//	
//	
//КонецПроцедуры  

//&НаКлиенте
//Асинх Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
//    Перем ОтветПередДобавлением;
//	Если ОтветПередДобавлением <> Истина Тогда
//		СтандартнаяОбработка = Ложь;
//		Результат = Ждать ВопросАсинх("Добавить номенклатуру в табличную часть?", РежимДиалогаВопрос.ДаНет);
//		
//		Если Результат = КодВозвратаДиалога.Да Тогда
//			ОтветПередДобавлением = Истина;
//			
//			Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
//				НоваяСтрока = Объект.Товары.Добавить();
//				НоваяСтрока.Номенклатура = ВыбранныйЭлемент;
//		 	КонецЦикла;
//			
//		КонецЕсли;
//		
//	Иначе
//		Для Каждого ВыбранныйЭлемент Из ВыбранноеЗначение Цикл
//			НоваяСтрока = Объект.Товары.Добавить();
//			НоваяСтрока.Номенклатура = ВыбранныйЭлемент;
//		КонецЦикла;
//		
//	КонецЕсли;

// 
//КонецПроцедуры